In [1]:
import pandas as pd
import numpy as np

In [2]:
dates = pd.date_range('2022-01-01', '2022-01-06', freq='D')
df1 = pd.DataFrame(np.random.randn(6,4), index = dates, columns=list(('ASK1','ASK2','ASK3','ASK4')))
df2 = pd.DataFrame (
    {

        "A": 1.0,

        "B": pd.date_range("2013-01-02","2013-01-05", freq='D'),

        "C": pd.Series(1, index=list(range(4)), dtype="float32"),

        "D": np.array([3] * 4, dtype="int32"),

        "E": pd.Categorical(["test", "train", "test", "train"]),

        "F": "foo",

    }
)

In [3]:
df2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [4]:
df2.describe()

         A    C    D
count  4.0  4.0  4.0
mean   1.0  1.0  3.0
std    0.0  0.0  0.0
min    1.0  1.0  3.0
25%    1.0  1.0  3.0
50%    1.0  1.0  3.0
75%    1.0  1.0  3.0
max    1.0  1.0  3.0

In [5]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-03 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-04 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-05 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

In [6]:
df2.sort_index(axis=1, ascending=False)

     F      E  D    C          B    A
0  foo   test  3  1.0 2013-01-02  1.0
1  foo  train  3  1.0 2013-01-03  1.0
2  foo   test  3  1.0 2013-01-04  1.0
3  foo  train  3  1.0 2013-01-05  1.0

In [7]:
df1.sort_values(by=("ask2").upper())

                ASK1      ASK2      ASK3      ASK4
2022-01-06 -1.165451 -0.965469 -0.545331  1.525140
2022-01-02  1.301711 -0.274784  0.578050 -0.876911
2022-01-03  0.672871 -0.274749 -1.175964  0.949196
2022-01-01 -1.330286  0.215210 -1.502953  0.031244
2022-01-05  0.589980  0.417643 -0.469700 -1.181372
2022-01-04 -0.386845  1.498891  0.566511  0.198761

In [8]:
pd.Timestamp('20310101', 'm')

Timestamp('2031-01-01 00:00:00', freq='M')

In [9]:
np.random.randn()

0.14184149359347759

In [10]:
pd.Series(np.arange(3.5,7.5), index=list(range(4)), dtype="float32")

0    3.5
1    4.5
2    5.5
3    6.5
dtype: float32

In [11]:
df1

                ASK1      ASK2      ASK3      ASK4
2022-01-01 -1.330286  0.215210 -1.502953  0.031244
2022-01-02  1.301711 -0.274784  0.578050 -0.876911
2022-01-03  0.672871 -0.274749 -1.175964  0.949196
2022-01-04 -0.386845  1.498891  0.566511  0.198761
2022-01-05  0.589980  0.417643 -0.469700 -1.181372
2022-01-06 -1.165451 -0.965469 -0.545331  1.525140

In [12]:
df1.loc[dates[0], 'ASK2']

0.21520962904303623

In [13]:
df1.at[dates[0], 'ASK3']

-1.502953481527039

In [14]:
df1.iloc[[3,4], [0,3]]

                ASK1      ASK4
2022-01-04 -0.386845  0.198761
2022-01-05  0.589980 -1.181372

In [15]:
df1.iat[1, 1]

-0.2747841691919098

In [16]:
df3 = df1.copy()
df3["E"] = ["one", "one", "two", "three", "four", "three"]

In [17]:
df3

                ASK1      ASK2      ASK3      ASK4      E
2022-01-01 -1.330286  0.215210 -1.502953  0.031244    one
2022-01-02  1.301711 -0.274784  0.578050 -0.876911    one
2022-01-03  0.672871 -0.274749 -1.175964  0.949196    two
2022-01-04 -0.386845  1.498891  0.566511  0.198761  three
2022-01-05  0.589980  0.417643 -0.469700 -1.181372   four
2022-01-06 -1.165451 -0.965469 -0.545331  1.525140  three

In [18]:
df3[df3["E"].isin(["two", "one"])]

                ASK1      ASK2      ASK3      ASK4    E
2022-01-01 -1.330286  0.215210 -1.502953  0.031244  one
2022-01-02  1.301711 -0.274784  0.578050 -0.876911  one
2022-01-03  0.672871 -0.274749 -1.175964  0.949196  two

In [21]:
s1 = pd.Series([1,2,3,4,5,6], index=pd.date_range('2022-01-01', periods=6))
s1

2022-01-01    1
2022-01-02    2
2022-01-03    3
2022-01-04    4
2022-01-05    5
2022-01-06    6
Freq: D, dtype: int64

In [23]:
df3['F']= s1
df3['F']

2022-01-01    1
2022-01-02    2
2022-01-03    3
2022-01-04    4
2022-01-05    5
2022-01-06    6
Freq: D, Name: F, dtype: int64

In [28]:
df4 = df1.copy()
df4

                ASK1      ASK2      ASK3      ASK4
2022-01-01 -1.330286  0.215210 -1.502953  0.031244
2022-01-02  1.301711 -0.274784  0.578050 -0.876911
2022-01-03  0.672871 -0.274749 -1.175964  0.949196
2022-01-04 -0.386845  1.498891  0.566511  0.198761
2022-01-05  0.589980  0.417643 -0.469700 -1.181372
2022-01-06 -1.165451 -0.965469 -0.545331  1.525140

In [33]:
df4[df4>0] = -df4
df4.where(df4<-1)

                ASK1      ASK2      ASK3      ASK4
2022-01-01 -1.330286       NaN -1.502953       NaN
2022-01-02 -1.301711       NaN       NaN       NaN
2022-01-03       NaN       NaN -1.175964       NaN
2022-01-04       NaN -1.498891       NaN       NaN
2022-01-05       NaN       NaN       NaN -1.181372
2022-01-06 -1.165451       NaN       NaN -1.525140

In [37]:
df5 = df1.reindex(index=dates[0:4], columns=list(df1.columns) + ["E"])
df5.loc[dates[2] : dates[3], "E"] = 1
df5

                ASK1      ASK2      ASK3      ASK4    E
2022-01-01 -1.330286  0.215210 -1.502953  0.031244  NaN
2022-01-02  1.301711 -0.274784  0.578050 -0.876911  NaN
2022-01-03  0.672871 -0.274749 -1.175964  0.949196  1.0
2022-01-04 -0.386845  1.498891  0.566511  0.198761  1.0

In [38]:
df5.dropna(how="any")

                ASK1      ASK2      ASK3      ASK4    E
2022-01-03  0.672871 -0.274749 -1.175964  0.949196  1.0
2022-01-04 -0.386845  1.498891  0.566511  0.198761  1.0

In [39]:
df5.fillna(value=4)

                ASK1      ASK2      ASK3      ASK4    E
2022-01-01 -1.330286  0.215210 -1.502953  0.031244  4.0
2022-01-02  1.301711 -0.274784  0.578050 -0.876911  4.0
2022-01-03  0.672871 -0.274749 -1.175964  0.949196  1.0
2022-01-04 -0.386845  1.498891  0.566511  0.198761  1.0

In [52]:
pd.isna(df5)

             ASK1   ASK2   ASK3   ASK4      E
2022-01-01  False  False  False  False   True
2022-01-02  False  False  False  False   True
2022-01-03  False  False  False  False  False
2022-01-04  False  False  False  False  False

In [56]:
inp = int(input('type in any number: '))
while inp>1:
    for i in range(2,inp//2):
        print(i)
        
    break
        
print(type(inp))

type in any number: 3
<class 'int'>

In [ ]:
x = int(input('Type in a prime number:'))